
exports.getStation = function(req,res,next){

/*    var line = {
        localStation:'碧海云天',
        line:22,
        nextStation:'以岭医院',
        terminalStation:'中通驾校',
        firstBus:'6:00',
        lastBus:'22:00',
        stations:['火车站','长途汽车站','保龙仓购物广场','居然丽家','爱尔眼科医院','（恒丰大酒店）','西三教东','供电局','西三教','春江花月','育星幼儿园',
            '祥隆泰','工运学校','石铜路北口','碧海云天','以岭医院','金石园区','西二环桃安公路','西二环前石公路口(西)','辛达院士园','辛达院士园南','中通驾校']
    };*/

    var station = [{
        "localStation":'碧海云天',
        'line':22,
        'nextStation':'以岭医院',
        'terminalStation':'中通驾校',
        'firstBus':'6:00',
        'lastBus':'22:00',
        'stations':['火车站','长途汽车站','保龙仓购物广场','居然丽家','爱尔眼科医院','（恒丰大酒店）','西三教东','供电局','西三教','春江花月','育星幼儿园',
            '祥隆泰','工运学校','石铜路北口','碧海云天','以岭医院','金石园区','西二环桃安公路','西二环前石公路口(西)','辛达院士园','辛达院士园南','中通驾校']
    },
        {
            "localStation":'碧海云天',
            'line':78,
            'nextStation':'以岭医院',
            'terminalStation':'汇华学院',
            'firstBus':'7:00',
            'lastBus':'21:00',
            'stations':['高社','联强小区','联强西区','泰华联盟路口','水上公园','滨湖新村','滨华路西口','北站','省医院','民政厅','新华区政府',
                '武警总队','烈士陵园','省三院','民心广场','草场街小学','碧海云天','以岭医院','玉威小区','城角街南口','省少管所','交通学院','汇华学院']
        }];
        res.render('index',{station:station});
};
